In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
list(range(1, 20, 2))

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19]

In [8]:
np.random.seed(12345)

In [9]:
import random
print(random.random())

0.3822649476585491

In [10]:
print(random.random())

0.9743985625953976

In [11]:
random.seed(10)
print(random.random())

0.5714025946899135

In [12]:
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))

In [13]:
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

In [14]:
data = {'state': ['Ujjain', 'Ujjain', 'Ujjain', 'Prayag', 'Prayag', 'Prayag'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [15]:
frame

    state  year  pop
0  Ujjain  2000  1.5
1  Ujjain  2001  1.7
2  Ujjain  2002  3.6
3  Prayag  2001  2.4
4  Prayag  2002  2.9
5  Prayag  2003  3.2

In [16]:
frame.T # Transposed

            0       1       2       3       4       5
state  Ujjain  Ujjain  Ujjain  Prayag  Prayag  Prayag
year     2000    2001    2002    2001    2002    2003
pop       1.5     1.7     3.6     2.4     2.9     3.2

In [17]:
frame.T.T

    state  year  pop
0  Ujjain  2000  1.5
1  Ujjain  2001  1.7
2  Ujjain  2002  3.6
3  Prayag  2001  2.4
4  Prayag  2002  2.9
5  Prayag  2003  3.2

In [18]:
pd.DataFrame(data, columns=['year', 'state', 'pop']) # Rearrange colomn as you mention

   year   state  pop
0  2000  Ujjain  1.5
1  2001  Ujjain  1.7
2  2002  Ujjain  3.6
3  2001  Prayag  2.4
4  2002  Prayag  2.9
5  2003  Prayag  3.2

In [19]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2

       year   state  pop debt
one    2000  Ujjain  1.5  NaN
two    2001  Ujjain  1.7  NaN
three  2002  Ujjain  3.6  NaN
four   2001  Prayag  2.4  NaN
five   2002  Prayag  2.9  NaN
six    2003  Prayag  3.2  NaN

In [20]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [21]:
frame2[['state']]

        state
one    Ujjain
two    Ujjain
three  Ujjain
four   Prayag
five   Prayag
six    Prayag

In [22]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [23]:
frame2['debt']  = 16.5

frame2.debt

one      16.5
two      16.5
three    16.5
four     16.5
five     16.5
six      16.5
Name: debt, dtype: float64

In [24]:
frame2

       year   state  pop  debt
one    2000  Ujjain  1.5  16.5
two    2001  Ujjain  1.7  16.5
three  2002  Ujjain  3.6  16.5
four   2001  Prayag  2.4  16.5
five   2002  Prayag  2.9  16.5
six    2003  Prayag  3.2  16.5

In [26]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [27]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [28]:
np.arange(9).reshape((3, 3))

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [29]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [31]:
frame.loc[['a', 'b', 'c', 'd'], states]

frame.iloc[[0,1,2], [0,1,2]]

KeyError: "Passing list-likes to .loc or [] with any missing labels is no longer supported. The following labels were missing: Index(['b'], dtype='object'). See https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike"

In [3]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
np.arange(16).reshape((4, 4))

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [36]:
data[data['three'] > 5] # filter

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [37]:
data[ data < 5] # filter

          one  two  three  four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  NaN    NaN   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN

In [38]:
data.iloc[:3, :3] # filter 0 to 2 and column 0 to 2

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10

In [39]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [40]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [41]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [42]:
df1 + df2 # add only same matching row and column / which not match NaN

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [43]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=['b','d','e'],
                     index=['Utah', 'Ohio', 'Texas', 'Oregon']) # Random Number
 
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [44]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=['b','d','e'],
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame = np.abs(frame) # abstract number
frame

               b         d         e
Utah    0.274992  0.228913  1.352917
Ohio    0.886429  2.001637  0.371843
Texas   1.669025  0.438570  0.539741
Oregon  0.476985  3.248944  1.021228

# lambda function
frame.apply(lambda x: x.max(), axis =1)

format = lambda x: '%.f' % x
frame.applymap(format)

frame['e'].map(format)

df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

df.sum()

df['sumax'] = df.sum(axis='columns')
df

df.describe()

In [5]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [4]:
data.apply(lambda x: x.max(), axis =1) # To row wise max/min/sum/mean here axis =1 mean row wise and axis = 0 colomn wise

Ohio         3
Colorado     7
Utah        11
New York    15
dtype: int64

In [6]:
data.apply(lambda x: x.min(), axis =1)

Ohio         0
Colorado     4
Utah         8
New York    12
dtype: int64

In [7]:
data.apply(lambda x: x.mean(), axis =1)

Ohio         1.5
Colorado     5.5
Utah         9.5
New York    13.5
dtype: float64

In [8]:
data.apply(lambda x: x.mean(), axis =0)

one      6.0
two      7.0
three    8.0
four     9.0
dtype: float64

In [10]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
format = lambda x: '%.f' % x
data.applymap(format)

         one two three four
Ohio       0   1     2    3
Colorado   4   5     6    7
Utah       8   9    10   11
New York  12  13    14   15

In [16]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [17]:
df.sum() # sum by column

one    9.25
two   -5.80
dtype: float64

In [18]:
df.sum(axis= 1) # sum by row

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [19]:
df.max(axis= 1)

a    1.40
b    7.10
c     NaN
d    0.75
dtype: float64

In [20]:
df['sumax'] = df.sum(axis='columns')

In [21]:
df

    one  two  sumax
a  1.40  NaN   1.40
b  7.10 -4.5   2.60
c   NaN  NaN   0.00
d  0.75 -1.3  -0.55

In [22]:
df['sumay'] = df.sum(axis='rows')

In [23]:
df

    one  two  sumax  sumay
a  1.40  NaN   1.40    NaN
b  7.10 -4.5   2.60    NaN
c   NaN  NaN   0.00    NaN
d  0.75 -1.3  -0.55    NaN

In [26]:
df.describe() # detail summary

            one       two     sumax  sumay
count  3.000000  2.000000  4.000000    0.0
mean   3.083333 -2.900000  0.862500    NaN
std    3.493685  2.262742  1.419727    NaN
min    0.750000 -4.500000 -0.550000    NaN
25%    1.075000 -3.700000 -0.137500    NaN
50%    1.400000 -2.900000  0.700000    NaN
75%    4.250000 -2.100000  1.700000    NaN
max    7.100000 -1.300000  2.600000    NaN

NameError: name 'sumay' is not defined